import java.security.NoSuchAlgorithmException;

public class CLS {
    public static void main(String[] args) throws NoSuchAlgorithmException {

        // Task 1. Создать консольное приложение "Учет книг в домашней библиотеке".
        //
        // Общие требования к заданию:
        //
        // - Система учитывает книги как в электронном, так и бумажном варианте.
        // - Существуют роли: пользователь, администратор.
        // - Пользователь может просмотривать книги в каталоге книг, осуществлять поиск книг в каталоге.
        // - Администратор может модифицировать каталог.
        // - * При добавлении описания книги в каталог опоещение о ней расслается на e-mail всем пользователям.
        // - ** При просмотре каталога желательно реализовать постраничный просмотр.
        // - *** Пользователь может предложить добавить книгу в библиотеку, переслав её администратору на e-mail.
        // - Каталог книг хранится в текстовом файте.
        // - Данные аутентификации пользователей хранится в текстовом файле. Пароль не хранится в открытом виде.

        ConsoleMenu consoleMenu = new ConsoleMenu();
    }
}