public class CLS {
    public static void main(String[] args) {

        // Task 3. Создайте клиент- серверное приложение "Архив"
        //
        // Общие требования к заданию:
        // - В архиве хранятся Дела (например, студентов). Архив находится на сервере.
        // - Клиент, в зависимости от прав, может запросить дело на просомотр, внести в него изменения,
        //   или создать новое дело.
        //
        // Требования к ходу лабораторной работы:
        // - Для реализации сетевого соединения используйте сокеты.
        // - Формат хранения данных на сервире xml-файлы
    }
}